app/Controllers/ProgramSarjana.php

    public function index()
    {

        $req = $this->request->getVar();
        $alumniModel = new \App\Models\AlumniModel();
        $propinsiModel = new \App\Models\PropinsiModel();
        $prodiModel = new \App\Models\ProdiModel();
        $occupationModel = new \App\Models\OccupationModel();
        $akademikModel = new \App\Models\AkademikModel();

        $data['request'] = $req;
        $data_alumni = $alumniModel->program_sarjana($req)->paginate(10);
        $i = 0;
        foreach ($data_alumni as $dtal) {
            $data_alumni[$i]['riwayat_akademik'] = $akademikModel->where('akademik.idorg', $data_alumni[$i]['id'])->findAll();
            $i++;
        }
        $data['alumni'] = $data_alumni;
        $data['pager'] = $alumniModel->pager;
        $data['provinces'] = $propinsiModel->findAll();
        $data['occupations'] = $occupationModel->findAll();
        $data['jenjang'] = $akademikModel->select('jenjang')->distinct()->findAll();
        $data['universitas'] = $akademikModel->select('universitas')->distinct()->findAll();
        $data['departemen'] = $akademikModel->select('departemen')->distinct()->findAll();
        $data['prodi'] = $prodiModel->findAll();
        $data['tmasuk'] = $akademikModel->select('tmasuk')->distinct()->orderBy('tmasuk', 'DESC')->findAll();
---
SELECT *
FROM `akademik`
WHERE `akademik`.`idorg` = '11'
SELECT *
FROM `propinsi`
SELECT *
FROM `occupations`
SELECT DISTINCT `jenjang`
FROM `akademik`
SELECT DISTINCT `universitas`
FROM `akademik`
SELECT DISTINCT `departemen`
FROM `akademik`
SELECT *
FROM `prodi`
SELECT DISTINCT `tmasuk`
FROM `akademik`
ORDER BY `tmasuk` DESC

    public function detail($id)
    {
        $alumniModel = new \App\Models\AlumniModel();
        $akademikModel = new \App\Models\AkademikModel();

        $data['alumni'] = $alumniModel->getDetail($id)->get()->getRowArray();
        $data['S1'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S1')->limit(1)->get()->getRowArray();
        $data['S2'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S2')->limit(1)->get()->getRowArray();
        $data['S3'] = $akademikModel->where('idOrg', $id)->where('jenjang', 'S3')->limit(1)->get()->getRowArray();

        $occupationModel = new \App\Models\OccupationModel();
        $propinsiModel = new \App\Models\PropinsiModel();
        $prodiModel = new \App\Models\ProdiModel();
        $angkatanModel = new \App\Models\AngkatanModel();

        $data['occupations'] = $occupationModel->findAll();
        $data['propinsi'] = $propinsiModel->findAll();
        $data['prodi'] = $prodiModel->findAll();
        $data['angkatan'] = $angkatanModel->findAll();
---
SELECT *
FROM `akademik`
WHERE `idOrg` = '16'
AND `jenjang` = 'S1'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idOrg` = '16'
AND `jenjang` = 'S2'
 LIMIT 1
SELECT *
FROM `akademik`
WHERE `idOrg` = '16'
AND `jenjang` = 'S3'
 LIMIT 1
SELECT *
FROM `occupations`
SELECT *
FROM `propinsi`
SELECT *
FROM `prodi`
SELECT *
FROM `angkatan`